Revit 2027 API
Construction Class
Construction definition for Project Information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Construction
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Construction
Public Class Construction
public ref class Construction
type Construction = class end
The Construction type exposes the following members.
Properties
Name | Description
Id | Get the id of the Construction.
Name | Get the name of the Construction.
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
This is used to define the information in Constructions.xml.
See Also
Reference
Autodesk.Revit.DB Namespace